Revit 2024 API
ScheduleDefinition.CanFilter Method
 Checks whether filters can be added to this ScheduleDefinition.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public bool CanFilter()
Visual Basic
Public Function CanFilter As Boolean
Visual C++
public:
bool CanFilter()
Return Value
 True if this ScheduleDefinition supports filters, false otherwise.
Remarks
 Key schedules and revision schedules do not support filters.
See Also
ScheduleDefinition Class
Autodesk.Revit.DB Namespace